---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.WorksetKindFilter
source: html/5cda2437-bb21-3fdd-b4d1-a8750343a65d.htm
---
# WorksetKindFilter Members

Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.